from random import choice

name_first = ['Де','Рейн','Лиар','Крог','Дуз','Брог','Леон','Сау','Кро','Рег','Заун','Дер','Блад','Стоун','Дед','Эмбер','Раум','Заг','Лорн','Эрин','Кейр','Каир']

name_second = ['берт','морт','ер','хард','ворт','уг','вог','мар','ворг','тейм','штайн','мог','таг','вард','мирн','дарт','мор']

surname = ['Кровавый','Ловкий','Великолепный','Гроза','Убийца','из','Король','Легенда','Властитель','Потомок','Потрошитель','Титан','Испепелитель','Пожиратель','Огнедышащий','Истребитель','Разумный','Властитель','Защитник','Бессмертный','Легендарный','Несокрушимый','Тиран','Забытый','Вечный','Алчный','Мудрый','Спящий','Дремлющий','Яростный','Охотник','Ужасный']

surname_power_first = ['Огне','Хладо','Змее','Железно','Стале','Смерто','Броне','Камне','Красно','Злобо','Остро','Коварно','Бело','Смрадо','Твердо','Крово','Злато']

surname_power_second = ['рог','зуб','крыл','глаз','бок','хвост','клык','спин','рык','бой']

ending_a = ['Королей','Людей','Волков','Нежити','Грифонов','Кроксов','Зверей','Ужаса','Гномов','Страха','Ночи','Небес','Эльфов','Драконов','Орков','Виверн']

place_adjective_a = ['Черной','Белой','Могучей','Воющей','Древней','Сияющей','Мрачной','Огненной','Ледяной','Хищной','Забытой','Ветхой','Красной','Кровавой']

place_adjective_b = ['Черных','Белых','Могучих','Воющих','Древних','Сияющих','Мрачных','Огненных','Ледяных','Хищных','Забытых','Ветхих','Крассных','Кровавых']

place_noun_a = ['крепости','башни','пещеры','пустыни','отмели','горы','чащи','топи','степи','реки','расщелины','бездны']
place_noun_b = ['болот','пещер','холмов','пустынь','морей','лесов','гор','болот','равнин','степей','рек','чащ','расщелин']

constructions = [' по прозвищу ',' известный '+ choice(['на севере ','на юге ','среди селян ','на западе ','на востоке ','среди смертных ','']) + 'как ',' более известный как ' , ' ошибочно именуемый ']