from random import choice

name_first = ['Де','Рейн','Лиар','Крог','Дуз','Брог','Леон','Сау','Кро','Рег','Заун','Дер','Блад','Стоун','Дед','Эмбер','Раум','Заг','Лорн','Эрин']

name_second = ['берт','морт','ер','хард','ворт','уг','вог','мар','ворг','тейм','штайн','мог','таг','вард','мирн']

surname = ['Кровавый','Ловкий','Великолепный','Гроза','Убийца','из','Король','Легенда','Властитель','Потомок','Потрошитель','Испепелитель','Пожиратель','Огнедышащий','Истребитель','Разумный','Властитель','Защитник','Бессмертный','Легендарный','Несокрушимый','Тиран','Забытый','Вечный','Алчный','Мудрый','Спящий','Дремлющий','Яростный']

surname_power_first = ['Огне','Хладо','Змее','Железно','Стале','Смерто','Броне','Камне','Красно','Злобо','Остро','Коварно']

surname_power_second = ['рог','зуб','крыл','глаз','бок','хвост']

ending_a = ['Королей','Людей','Волков','Нежити','Грифонов','Кроксов','Зверей','Ужаса','Гномов','Страха','Ночи','Небес']

place_adjective_a = ['Черной','Белой','Могучей','Воющей','Древней','Сияющей','Мрачной','Огненной','Ледяной','Хищной','Забытой']

place_adjective_b = ['Черных','Белых','Могучих','Воющих','Древних','Сияющих','Мрачных','Огненных','Ледяных','Хищных','Забытых']

place_noun_a = ['крепости','башни','пещеры','пустыни','отмели','горы','чащи','топи']
place_noun_b = ['болот','пещер','холмов','пустынь','морей','лесов','гор','болот','равнин']

constructions = [' по прозвищу ',' известный '+ choice(['на севере ','на юге ','среди селян ','на западе ','на востоке ','среди смертных ','']) + 'как ',' более известный как ' , ' ошибочно именуемый ']